import React from "react"

export class BioComponent extends React.Component<any, any> {
        render() {
            return (
                <div class="ui segment">
                    <p>
                    อ่านเรื่องย่อก่อนดูหนัง รุ่นพี่ Senior (2015) สรุปย่อเรื่องราว คู่หูนักสืบต่างมิติที่โคจรมาพบกันเพื่อสะสางคดีเก่าในอดีต
                    หนึ่งคือ เด็กนักเรียนสาวชั้น ม.6 ในโรงเรียนประจำแห่งหนึ่ง เธอมีนิสัยประหลาด ชอบเก็บตัวไม่สุงสิงกับใคร
                    </p>
                  <img className="ui small left floated image" src="/images/img10.jpg"/>
                    <p>
                    และชอบพูดคนเดียว จนเพื่อนๆ ทุกคนหาว่าเธอเพี้ยน แต่จริงๆ แล้วเธอมีความสามารถพิเศษอย่างหนึ่งคือ
                    เธอได้กลิ่นวิญญาณคนตาย ส่วนอีกหนึ่งคือ วิญญาณของชายหนุ่มลึกลับ ที่เธอเรียกเขาว่า “รุ่นพี่”
                    ไม่เคยมีใครเคยเห็นเขาแม้แต่ตัวเธอเอง เพราะเขาบอกว่า คนที่จะมองเห็นเขาได้ คือคนที่กำลังจะตายแล้วเท่านั้น
                    </p>
                  <img className="ui small right floated image" src="/images/img2.jpg"/>
                    <p>
                                        เรื่องย่อ
                    คู่หูนักสืบต่างมิติที่โคจรมาพบกันเพื่อสะสางคดีเก่าในอดีต
                    หนึ่งคือ เด็กนักเรียนสาวชั้น ม.6 ในโรงเรียนประจำแห่งหนึ่ง เธอมีนิสัยประหลาด ชอบเก็บตัวไม่สุงสิงกับใคร และชอบพูดคนเดียว จนเพื่อนๆ ทุกคนหาว่าเธอเพี้ยน แต่จริงๆ แล้วเธอมีความสามารถพิเศษอย่างหนึ่งคือ เธอได้กลิ่นวิญญาณคนตาย
                    ส่วนอีกหนึ่งคือ วิญญาณของชายหนุ่มลึกลับ ที่เธอเรียกเขาว่า “รุ่นพี่” ไม่เคยมีใครเคยเห็นเขาแม้แต่ตัวเธอเอง เพราะเขาบอกว่า คนที่จะมองเห็นเขาได้ คือคนที่กำลังจะตายแล้วเท่านั้น!!!
                    ทั้งสองต้องร่วมกันสืบคดีฆาตรรมที่เกิดขึ้นเมื่อ 50 ปีก่อนในวังเก่าของเชื้อพระวงศ์ท่านหนึ่ง
                    </p>
                    <p>
                    ซึ่งปัจจุบันก็คือโรงเรียนประจำที่เด็กสาวเรียนอยู่ ผู้ตายคือ หม่อมเจ้าหญิงพรรณวดีฯ ถูกสังหารอย่างโหดเหี้ยมโดยมีคนสวนเก่าแก่ตกเป็นผู้ต้องหา เขาถูกตัดสินให้ประหารชีวิตด้วยการยิงเป้าทั้งที่เขายืนยันว่าตัวเองบริสุทธิ์ วิญญาณคนสวนจึงยังวนเวียนอยู่ภายในตึกพรรณวดีฯ และปรากฏร่างให้คนเห็นอยู่เสมอเพื่อร้องหาความยุติธรรม
                    ทั้งสองพยายามรื้อคดีขึ้นมาใหม่เพื่อสืบหาฆาตกรตัวจริง จากหลักฐานพยานอันน้อยนิดที่หลงเหลืออยู่ในตึกพรรณวดีฯแห่งนั้น ระหว่างทางก็ต้องผจญกับผู้คนที่เกี่ยวข้องและวิญญาณร้ายอีกหลายดวง ที่พยายามจะหยุดยั้งการสืบสวนของทั้งคู่ให้ได้
                    ขณะเดียวกันเธอเองก็ต้องค้นหาให้ได้ว่า วิญญาณของ“รุ่นพี่” ผู้นั้นคือใคร และตายด้วยสาเหตุอะไร!!!
                    ภาพยนตร์ที่จะเปลี่ยนความเชื่อเรื่องผีของคุณไปตลอดกาล
                    </p>
                </div>
            );
        }
}